{
    "Name": " IAM - Identify and Access Management",
    "IAM": "Identify and Access Management, Global Service",
    "Personal credentials": {
        "user": "maycondss",
        "pass": "Cp1132rm7sZ",
        "url": "https://215717951792.signin.aws.amazon.com/console",
        "url-alias": "",
        "info": "We should never use a root account, it is interesting be using a role defined account for deploy and development"
    },
    "IAM Policies Inheritance": {
        "Groups": "Same system as linux, an user can be on multiple groups and have different roles and access",
        "Permission": "Assigned by a Json Document called Policies",
        "IAM Policies Structure": {
            "Version": "2012-10-17",
            "Id": "optional. An identifier for the policy",
            "Statement": {
                "Sid": "Statement ID. Optional",
                "Effect": "Allow or Deny Access",
                "Principal": "Account, user or row that should have effect",
                "Action": "List of actions that the policy allows or denies",
                "Resource": "List of recourse that the actions applies to.",
                "Condition": "conditions for when this policy is in effect. Optional"
            }
        },
        "Info": "You can create a file for IAM Policies manually or using the Assistent on the AWS IAM",
        "Password Policies": "You can define User Password Policies, so the user will be forced to follow the rules defined by root.",
        "MFA": "It is a good practice user a Password + Device to connect to those accounts"
    },
    "Access AWS System": {
        "AWS Management Console": "Password + MFA",
        "AWS Command Line Interface": "CLI - Protected by Access Key",
        "AWS Software Development Kit": "SDK - for code, Protected by access key"
    },
    "hands on": {
        "CLI": "Download CLI from aws website",
        "commands": {
            "aws configure": "The first command to add aws info",
            "how to": "copy and paste data from AWS KEY and region. Output format is not mandatory",
            "additional info": "you can add a new key from IAM users (Do not create for a Root account)"
        },
        "cloud-shell": "it is an online CLI that can be used through aws website"
    },
    "IAM roles for Services": "Some services will need to change things on your behalf, so you can assign permissions to them to do so.",
    "IAM Security Tools": {
        "IAM Credentials Report": "Account Level - Report that lists your accounts users and the status of their credentials",
        "IAM Access Advisor": "User Level -  Shows the service permissions granted to a user and when those services were last accessed"
    },
    "Best Practices": {
        "A": "Dont use root account, except fot aws account setup",
        "B": "One physical user = One AWS User",
        "C": "Use MFA",
        "D": "Create Strong Password Policy",
        "E": "Create Roles for giving Permissions to AWS services",
        "F": "Use Access Key for CLI and SDK",
        "G": "Use reports to audit accounts",
        "H": "NEVER SHARE USERS AND ACCESS KEYS"
    },
    "Shared Responsability model for IAM": {
        "AWS": "Infrastructure (Global Security), Configuration and vulnerability Analysis, Compliance Validation",
        "You": "Users, groups, policies, management and monitoring, enable MFA on accounts, Take care of keys, use IAM tools, Analyze reports and permissions."
    }
}